2026-07-30_candela-hypar-shell-valencia/04_cfd/case/0/U
FoamFile
{
    version 2.0; format ascii; class volVectorField; location "0"; object U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
    inlet
    {
        type atmBoundaryLayerInletVelocity; flowDir (-1 0 0); zDir (0 0 1);
        Uref 4.4; Zref 10; z0 uniform 0.5; d uniform 0; value uniform (0 0 0);
    }
    outlet  { type inletOutlet; inletValue uniform (0 0 0); value uniform (0 0 0); }
    top     { type slip; }
    sides   { type slip; }
    ground  { type noSlip; }
    "(shell|glazing).*" { type noSlip; }
}
