2026-07-30_candela-hypar-shell-valencia/04_cfd/case/0/alphat
FoamFile
{
    version 2.0; format ascii; class volScalarField; location "0"; object alphat;
}

dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet   { type calculated; value uniform 0; }
    outlet  { type calculated; value uniform 0; }
    top     { type zeroGradient; }
    sides   { type zeroGradient; }
    ground  { type calculated; value uniform 0; }
    "(shell|glazing).*" { type calculated; value uniform 0; }
}
