2026-07-30_candela-hypar-shell-valencia/04_cfd/case/0/k
FoamFile
{
    version 2.0; format ascii; class volScalarField; location "0"; object k;
}

dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.5;
boundaryField
{
    inlet
    {
        type atmBoundaryLayerInletK; flowDir (-1 0 0); zDir (0 0 1);
        Uref 4.4; Zref 10; z0 uniform 0.5; d uniform 0; value uniform 0.5;
    }
    outlet  { type inletOutlet; inletValue uniform 0.5; value uniform 0.5; }
    top     { type zeroGradient; }
    sides   { type zeroGradient; }
    ground  { type kqRWallFunction; value uniform 0.5; }
    "(shell|glazing).*" { type kqRWallFunction; value uniform 0.5; }
}
