2026-07-30_candela-hypar-shell-valencia/04_cfd/case/0/p_rgh
FoamFile
{
    version 2.0; format ascii; class volScalarField; location "0"; object p_rgh;
}

dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet   { type fixedFluxPressure; value uniform 0; }
    outlet  { type fixedValue; value uniform 0; }
    top     { type zeroGradient; }
    sides   { type zeroGradient; }
    ground  { type fixedFluxPressure; value uniform 0; }
    "(shell|glazing).*" { type fixedFluxPressure; value uniform 0; }
}
