2026-07-30_candela-hypar-shell-valencia/04_cfd/case/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| Candela hypar shell - natural ventilation, buoyantBoussinesqSimpleFoam       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0; format ascii; class uniformDimensionedVectorField; location "constant"; object g;
}

dimensions [0 1 -2 0 0 0 0];
value (0 0 -9.81);
