2026-07-30_candela-hypar-shell-valencia/04_cfd/case/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
| Candela hypar shell - natural ventilation, buoyantBoussinesqSimpleFoam       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0; format ascii; class dictionary; location "constant"; object momentumTransport;
}

simulationType RAS;
RAS { model kEpsilon; turbulence on; printCoeffs on; }
