2026-07-30_candela-hypar-shell-valencia/04_cfd/case/constant/physicalProperties
FoamFile
{
    version 2.0; format ascii; class dictionary; location "constant"; object physicalProperties;
}

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1.5e-05;
beta            [0 0 0 -1 0 0 0] 3.31e-03;
TRef            [0 0 0 1 0 0 0] 301.45;
Pr              [0 0 0 0 0 0 0] 0.71;
Prt             [0 0 0 0 0 0 0] 0.85;
