2026-07-30_candela-hypar-shell-valencia/04_cfd/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Candela hypar shell - natural ventilation, buoyantBoussinesqSimpleFoam       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0; format ascii; class dictionary; location "system"; object blockMeshDict;
}

scale 1;
vertices
(
    (-140 -70 0) (70 -70 0) (70 70 0) (-140 70 0)
    (-140 -70 60) (70 -70 60) (70 70 60) (-140 70 60)
);
blocks ( hex (0 1 2 3 4 5 6 7) (60 40 17) simpleGrading (1 1 1) );
edges ();
boundary
(
    inlet  { type patch; faces ( (1 2 6 5) ); }
    outlet { type patch; faces ( (0 4 7 3) ); }
    ground { type wall;  faces ( (0 3 2 1) ); }
    top    { type patch; faces ( (4 5 6 7) ); }
    sides  { type patch; faces ( (0 1 5 4) (3 7 6 2) ); }
);
mergePatchPairs ();
