2026-07-30_candela-hypar-shell-valencia/04_cfd/case/system/decomposeParDict
FoamFile
{
    version 2.0; format ascii; class dictionary; location "system"; object decomposeParDict;
}
numberOfSubdomains 8;
method          hierarchical;
hierarchicalCoeffs { n (4 2 1); order xyz; }
