2026-07-30_candela-hypar-shell-valencia/04_cfd/case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| Candela hypar shell - natural ventilation, buoyantBoussinesqSimpleFoam       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0; format ascii; class dictionary; location "system"; object fvSolution;
}

solvers
{
    p_rgh
    {
        solver GAMG; tolerance 1e-7; relTol 0.01;
        smoother GaussSeidel;
    }
    "(U|T|k|epsilon)"
    {
        solver PBiCGStab; preconditioner DILU;
        tolerance 1e-8; relTol 0.1;
    }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    residualControl { p_rgh 1e-3; U 1e-4; T 1e-4; "(k|epsilon)" 1e-3; }
}
relaxationFactors
{
    fields  { p_rgh 0.3; }
    equations { U 0.5; T 0.5; "(k|epsilon)" 0.5; }
}
