2026-07-30_candela-hypar-shell-valencia/04_cfd/case/system/sampleDict
FoamFile
{
    version 2.0; format ascii; class dictionary; location "system"; object sampleDict;
}

type probes;
libs ("libsampling.so");
fields (U T);
probeLocations
(
    (-24 -24 0.5)
    (-24 -23.5 0.5)
    (-24 -23 0.5)
    (-24 -22.5 0.5)
    (-24 -22 0.5)
    (-24 -21.5 0.5)
    (-24 -21 0.5)
    (-24 -20.5 0.5)
    (-24 -20 0.5)
    (-24 -19.5 0.5)
    (-24 -19 0.5)
    (-24 -18.5 0.5)
    (-24 -18 0.5)
    (-24 -17.5 0.5)
    (-24 -17 0.5)
    (-24 -16.5 0.5)
    (-24 -16 0.5)
    (-24 -15.5 0.5)
    (-24 -15 0.5)
    (-24 -14.5 0.5)
    (-24 -14 0.5)
    (-24 -13.5 0.5)
    (-24 -13 0.5)
    (-24 -12.5 0.5)
    (-24 -12 0.5)
    (-24 -11.5 0.5)
    (-24 -11 0.5)
    (-24 -10.5 0.5)
    (-24 -10 0.5)
    (-24 -9.5 0.5)
    (-24 -9 0.5)
    (-24 -8.5 0.5)
    (-24 -8 0.5)
    (-24 -7.5 0.5)
    (-24 -7 0.5)
    (-24 -6.5 0.5)
    (-24 -6 0.5)
    (-24 -5.5 0.5)
    (-24 -5 0.5)
    (-24 -4.5 0.5)
    (-24 -4 0.5)
    (-24 -3.5 0.5)
    (-24 -3 0.5)
    (-24 -2.5 0.5)
    (-24 -2 0.5)
    (-24 -1.5 0.5)
    (-24 -1 0.5)
    (-24 -0.5 0.5)
    (-24 0 0.5)
    (-24 0.5 0.5)
    (-24 1 0.5)
    (-24 1.5 0.5)
    (-24 2 0.5)
    (-24 2.5 0.5)
    (-24 3 0.5)
    (-24 3.5 0.5)
    (-24 4 0.5)
    (-24 4.5 0.5)
    (-24 5 0.5)
    (-24 5.5 0.5)
    (-24 6 0.5)
    (-24 6.5 0.5)
    (-24 7 0.5)
    (-24 7.5 0.5)
    (-24 8 0.5)
    (-24 8.5 0.5)
    (-24 9 0.5)
    (-24 9.5 0.5)
    (-24 10 0.5)
    (-24 10.5 0.5)
    (-24 11 0.5)
    (-24 11.5 0.5)
    (-24 12 0.5)
    (-24 12.5 0.5)
    (-24 13 0.5)
    (-24 13.5 0.5)
    (-24 14 0.5)
    (-24 14.5 0.5)
    (-24 15 0.5)
    (-24 15.5 0.5)
    (-24 16 0.5)
    (-24 16.5 0.5)
    (-24 17 0.5)
    (-24 17.5 0.5)
    (-24 18 0.5)
    (-24 18.5 0.5)
    (-24 19 0.5)
    (-24 19.5 0.5)
    (-24 20 0.5)
    (-24 20.5 0.5)
    (-24 21 0.5)
    (-24 21.5 0.5)
    (-24 22 0.5)
    (-24 22.5 0.5)
    (-24 23 0.5)
    (-24 23.5 0.5)
    (-24 24 0.5)
    (-23.5 -24 0.5)
    (-23.5 -23.5 0.5)
...
);
